api/app/controllers/menus_controller.rb

SELECT "menus".* FROM "menus"
---
    def index
        render json: Menu.all, status: :ok